Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties
Serialization structure for AnalysisPartAnalysisProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties._AnalysisClass
The analysis class of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties._BuiltupMode
The builtup mode of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties._DesignGroup
The design group of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties._PhysicalFreezed
This indicates whether the pysical part has been freezed.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties.ToStruct(Tekla.Structures.Analysis.AnalysisPartAnalysisProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAnalysisProperties.FromStruct(Tekla.Structures.Analysis.AnalysisPartAnalysisProperties)
DO NOT USE! For internal usage only!
P: P.